# Pandas

In [1]:
import pandas as pd

import numpy as np

In [2]:
pd.__version__

'0.24.2'

In [3]:
# creating an Empty Panda series 

PD_Series = pd.Series()

PD_Series

Series([], dtype: float64)

In [4]:
# Creating Panda Series from ndarray

Array_data = np.array(['a','b','c','d'])

Alpha_Series = pd.Series(Array_data)

Alpha_Series

0    a
1    b
2    c
3    d
dtype: object

In [5]:
# Creating Panda Series from a dictionary

Dict = {'A':100 , 'B':200 , 'C':300 , 'D':400}

print(Dict)

Dict_PD_Series = pd.Series(Dict)

Dict_PD_Series

{'A': 100, 'B': 200, 'C': 300, 'D': 400}

A    100
B    200
C    300
D    400
dtype: int64

In [9]:
Dict_PD_Series = pd.Series(Dict , index=['D','C','A'])

Dict_PD_Series

D    400
C    300
A    100
dtype: int64

In [7]:
# Creating panda series from a Scalar 

Scalar_PD_Series = pd.Series(8 , index =[2,5,7,9])

Scalar_PD_Series

2    8
5    8
7    8
9    8
dtype: int64

In [8]:
type(Scalar_PD_Series)

pandas.core.series.Series

## Dataframe

In [9]:
# Create an empty Dataframe

df = pd.DataFrame()

print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
# Create a DF from a list 

List_Data = ['ABC' , 'WXY' , 'PQR' , 'LMN']

DF_From_List = pd.DataFrame(List_Data)

DF_From_List

     0
0  ABC
1  WXY
2  PQR
3  LMN

In [11]:
type(DF_From_List)

pandas.core.frame.DataFrame

In [13]:
# Create DF from a Dictionary 

Dict = {'Name':['ABC' , 'XYZ' , 'LMN' , 'PQR'] , 'Salary':[10000 , 24000 , 15000 , 32000]}

DF_from_Dict = pd.DataFrame(Dict)

DF_from_Dict

  Name  Salary
0  ABC   10000
1  XYZ   24000
2  LMN   15000
3  PQR   32000

### Attributes of a Dataframe

In [14]:
# check the type of Dataframe object 

type(DF_from_Dict)

pandas.core.frame.DataFrame

In [64]:
# get the number of rows & columns of a Dataframe

DF_from_Dict.shape

(4, 2)

In [15]:
DF_from_Dict.columns

Index(['Name', 'Salary'], dtype='object')

In [16]:
# get the column names of a Dataframe 

list(DF_from_Dict.columns)

['Name', 'Salary']

In [17]:
# get the column number from a column name

DF_from_Dict.columns.get_loc('Salary')

1

In [18]:
# Summary of Dataframe data  ( normally shown for numerical column if any in dataframe )

DF_from_Dict.describe()

             Salary
count      4.000000
mean   20250.000000
std     9742.518497
min    10000.000000
25%    13750.000000
50%    19500.000000
75%    26000.000000
max    32000.000000

In [78]:
# To get the summary of categorical column

DF_from_Dict['Name'].describe()

count       4
unique      4
top       PQR
freq        1
Name: Name, dtype: object

In [91]:
DF_from_Dict.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
Name      4 non-null object
Salary    4 non-null int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [80]:
# show first n observations

DF_from_Dict.head(2)

  Name  Salary
0  ABC   10000
1  XYZ   24000

In [81]:
# show last n observations

DF_from_Dict.tail(2)

  Name  Salary
2  LMN   15000
3  PQR   32000

In [19]:
# Creating DF from a List of Dictionary

List_Dict = [{'A':10 , 'B':20 , 'C':40} , {'A':25 , 'C':55}]

DF_from_List_Dict = pd.DataFrame(List_Dict)

DF_from_List_Dict

    A     B   C
0  10  20.0  40
1  25   NaN  55

In [41]:
# Creating Data Frame from Dictionary of PD.Series 

Dict_Series = {'One':pd.Series([1,2,3],index=['a','b','c']),
               'Two':pd.Series([11,22,33,44],index=['a','b','c','d'])}

DF_Dict_Series = pd.DataFrame(Dict_Series)

DF_Dict_Series

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44

### Accessing elements of a Data Frame

#### The primary purpose of the DataFrame indexing operator, [] is to select columns.
When the indexing operator is passed a string or integer, it attempts to find a column with that particular name and return it as a Series.

#### The DataFrame indexing operator completely changes behavior to select rows when slice notation is used
Strangely, when given a slice, the DataFrame indexing operator selects rows and can do so by integer location or by index label.

In [21]:
## Accessing specific rows using index of a dataframe

# Show the index of a Dataframe
DF_Dict_Series.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [28]:
DF_Dict_Series

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44

### Accessing Rows

In [29]:
DF_Dict_Series['a':'c']

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33

In [30]:
DF_Dict_Series['b':]

   One  Two
b  2.0   22
c  3.0   33
d  NaN   44

In [31]:
DF_Dict_Series[:'c']

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33

In [32]:
DF_Dict_Series

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44

In [34]:
# Method 1 ; by row position 

DF_Dict_Series[:1]

   One  Two
a  1.0   11

In [35]:
# Method 2 ; by range row positions 

DF_Dict_Series[0:2]

   One  Two
a  1.0   11
b  2.0   22

In [36]:
# Method 3 - Fetching all rows starting from specific position till end of row

DF_Dict_Series[2:]

   One  Two
c  3.0   33
d  NaN   44

In [37]:
# Deleting columns of a Dataframe : Method 1 
print(DF_Dict_Series)

del(DF_Dict_Series['Two'])

print(DF_Dict_Series)

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44
   One
a  1.0
b  2.0
c  3.0
d  NaN

In [32]:
# Method 4 - Fetching all rows starting from first row till specified row 

DF_Dict_Series[:3]

   One  Three
a  1.0     31
b  2.0     32
c  3.0     33

### Accessing Columns

In [42]:
DF_Dict_Series

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44

In [43]:
# Selecting specific Column from a DF 

DF_Dict_Series['One']

a    1.0
b    2.0
c    3.0
d    NaN
Name: One, dtype: float64

In [46]:
DF_Dict_Series['Two']

a    11
b    22
c    33
d    44
Name: Two, dtype: int64

In [45]:
type(DF_Dict_Series['Two'])

pandas.core.series.Series

In [47]:
DF_Dict_Series.Two

a    11
b    22
c    33
d    44
Name: Two, dtype: int64

In [48]:
DF_Dict_Series[['Two','One']]

   Two  One
a   11  1.0
b   22  2.0
c   33  3.0
d   44  NaN

### Combining Column & Row access

In [55]:
DF_Dict_Series

   One  Two
a  1.0   11
b  2.0   22
c  3.0   33
d  NaN   44

In [51]:
DF_Dict_Series['Two']

a    11
b    22
c    33
d    44
Name: Two, dtype: int64

In [53]:
DF_Dict_Series['Two'][2:4]

c    33
d    44
Name: Two, dtype: int64

In [54]:
DF_Dict_Series[['Two']][2:4]

   Two
c   33
d   44

### Altering the Dataframe

In [56]:
# Adding new column to a Data Frame : Method - 1

# print(DF_Dict_Series['Three'])

DF_Dict_Series['Three'] = pd.Series([31,32,33,34], index=['a','b','c','d'])

print(DF_Dict_Series)

print('\n')

print(DF_Dict_Series['Three'])

   One  Two  Three
a  1.0   11     31
b  2.0   22     32
c  3.0   33     33
d  NaN   44     34


a    31
b    32
c    33
d    34
Name: Three, dtype: int64

In [58]:
# Adding new column to a Data Frame : Method - 2


DF_Dict_Series['Four'] = DF_Dict_Series['Two'] + DF_Dict_Series['Three']

print(DF_Dict_Series)

print('\n')

print(DF_Dict_Series['Four'])

   One  Two  Three  Four
a  1.0   11     31    42
b  2.0   22     32    54
c  3.0   33     33    66
d  NaN   44     34    78


a    42
b    54
c    66
d    78
Name: Four, dtype: int64

In [59]:
# Deleting columns of a Dataframe : Method 2 
print(DF_Dict_Series)

DF_Dict_Series.pop('Four')

print(DF_Dict_Series)

   One  Two  Three  Four
a  1.0   11     31    42
b  2.0   22     32    54
c  3.0   33     33    66
d  NaN   44     34    78
   One  Two  Three
a  1.0   11     31
b  2.0   22     32
c  3.0   33     33
d  NaN   44     34

### Accessing Dataframe elements using 'Accessor' - [ .loc() or .iloc() ]

.loc() - accessor using index label for rows and column names for columns

.iloc() - accessor using row index & column index numbers

#### .loc()

In [60]:
DF_Dict_Series

   One  Two  Three
a  1.0   11     31
b  2.0   22     32
c  3.0   33     33
d  NaN   44     34

In [61]:
### Accessing by location / position name ( using .loc() )

DF_Dict_Series.loc['c']

One       3.0
Two      33.0
Three    33.0
Name: c, dtype: float64

In [62]:
DF_Dict_Series.loc[['c','b']]

   One  Two  Three
c  3.0   33     33
b  2.0   22     32

In [63]:
DF_Dict_Series.loc[['c','b'],'Three']

c    33
b    32
Name: Three, dtype: int64

In [64]:
DF_Dict_Series.loc[['c','b'],['Three']]

   Three
c     33
b     32

#### .iloc()

In [65]:
DF_Dict_Series

   One  Two  Three
a  1.0   11     31
b  2.0   22     32
c  3.0   33     33
d  NaN   44     34

In [66]:
DF_Dict_Series.iloc[1:3 , 1:2]

   Two
b   22
c   33

In [67]:
# Appending a Row 

DF_Dict_Series

DF_Dict_Series_New = pd.DataFrame([[23,34,45,56]],columns=['One','Two','Three','Four'])

DF_Dict_Series.append(DF_Dict_Series_New)

C:\Users\itzpr\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   Four   One  Three  Two
a   NaN   1.0     31   11
b   NaN   2.0     32   22
c   NaN   3.0     33   33
d   NaN   NaN     34   44
0  56.0  23.0     45   34

In [68]:
DF_Dict_Series

   One  Two  Three
a  1.0   11     31
b  2.0   22     32
c  3.0   33     33
d  NaN   44     34

In [69]:
Cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000]
        }

df_Cars = pd.DataFrame(Cars)

df_Cars

            Brand  Price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

In [70]:
BRICS_DF = pd.read_csv("C:\\Users\\itzpr\\BRICS.csv")

In [71]:
BRICS_DF

  Unnamed: 0       country    capital    area  population
0         BR        Brazil   Brasilia   8.516      200.40
1         RU        Russia     Moscow  17.100      143.50
2         IN         India  New Delhi   3.286     1252.00
3         CH         China    Beijing   9.597     1357.00
4         SA  South Africa   Pretoria   1.221       52.98

In [73]:
Cond = (BRICS_DF.area > 5) & (BRICS_DF.area < 10)

In [74]:
Cond

0     True
1    False
2    False
3     True
4    False
Name: area, dtype: bool

In [75]:
BRICS_DF[Cond]

  Unnamed: 0 country   capital   area  population
0         BR  Brazil  Brasilia  8.516       200.4
3         CH   China   Beijing  9.597      1357.0

#### Create a Copy of a Dataframe

In [76]:
BRICS_DF_CPY = BRICS_DF.copy()

### Delete a column from a Dataframe

In [77]:
del BRICS_DF_CPY['area']

In [78]:
BRICS_DF_CPY

  Unnamed: 0       country    capital  population
0         BR        Brazil   Brasilia      200.40
1         RU        Russia     Moscow      143.50
2         IN         India  New Delhi     1252.00
3         CH         China    Beijing     1357.00
4         SA  South Africa   Pretoria       52.98

In [119]:
BRICS_DF_CPY.pop('capital')

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: capital, dtype: object

In [120]:
BRICS_DF_CPY

  Unnamed: 0       country  population
0         BR        Brazil      200.40
1         RU        Russia      143.50
2         IN         India     1252.00
3         CH         China     1357.00
4         SA  South Africa       52.98